[Killed] BlockStatement
ross/repos/useAdapter/useAdapter.js:4:50
 import { useState } from 'react'
 import equal from 'fast-deep-equal'
 
-export default function useInput(display, parse) {
-    const [low, setLow] = useState()
-    const [parsed, setParsed] = useState({})
-
-    return [
-        high => equal(high, parsed) ? low : display(high),
-        low => {
-            { setLow(low) }
-            let parsed = parse(low)
-            { setParsed(parsed) }
-            return parsed
-        }
-    ]
-}
+export default function useInput(display, parse) {}
 
 
killedBy: displays value
statusReason: TypeError: Invalid attempt to destructure non-iterable instance.
In order to be iterable, non-array objects must have a [Symbol.iterator]() method.

[Killed] ArrowFunction
ross/repos/useAdapter/useAdapter.js:9:9
     const [parsed, setParsed] = useState({})
 
     return [
-        high => equal(high, parsed) ? low : display(high),
+        () => undefined,
         low => {
             { setLow(low) }
killedBy: displays value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "5"
Received: ""

[Killed] BlockStatement
ross/repos/useAdapter/useAdapter.js:10:16
 
     return [
         high => equal(high, parsed) ? low : display(high),
-        low => {
-            { setLow(low) }
-            let parsed = parse(low)
-            { setParsed(parsed) }
-            return parsed
-        }
+        low => {}
     ]
 }
killedBy: fires onChange event
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: undefined

[Killed] BlockStatement
ross/repos/useAdapter/useAdapter.js:11:13
     return [
         high => equal(high, parsed) ? low : display(high),
         low => {
-            { setLow(low) }
+            {}
             let parsed = parse(low)
             { setParsed(parsed) }
killedBy: changes input value even if upper-level value is unchanged
statusReason: TypeError: Cannot read properties of undefined (reading 'toString')

[Killed] BlockStatement
ross/repos/useAdapter/useAdapter.js:13:13
         low => {
             { setLow(low) }
             let parsed = parse(low)
-            { setParsed(parsed) }
+            {}
             return parsed
         }
killedBy: expect abstracted data to be retained
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "10."
Received: "10"
