[Killed] BlockStatement
ross/repos/useAdapter/useAdapter.js:4:50
 import { useState } from 'react'
 import equal from 'fast-deep-equal/es6'
 
-export default function useInput(display, parse) {
-    const [low, setLow] = useState()
-    const [parsed, setParsed] = useState({})
-
-    return [
-        high => equal(high, parsed) ? low : display(high),
-        low => {
-            setLow(low)
-            let parsed = parse(low)
-            setParsed(parsed)
-            return parsed
-        }
-    ]
-}
+export default function useInput(display, parse) {}
 
 
killedBy: displays value
statusReason: TypeError: Invalid attempt to destructure non-iterable instance.
In order to be iterable, non-array objects must have a [Symbol.iterator]() method.

[Killed] BlockStatement
ross/repos/useAdapter/useAdapter.js:10:16
 
     return [
         high => equal(high, parsed) ? low : display(high),
-        low => {
-            setLow(low)
-            let parsed = parse(low)
-            setParsed(parsed)
-            return parsed
-        }
+        low => {}
     ]
 }
killedBy: fires onChange event
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: undefined
